In [1]:
%load_ext autoreload

In [2]:
%autoreload 2

In [3]:
import openai
openai.api_key = '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'

import os
os.environ['OPENAI_API_KEY']='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'

In [4]:
%load_ext chapyter

2023-09-22 17:20:27.012 WARNING streamlit.runtime.state.session_state_proxy: Session state does not function when running a script without `streamlit run`

In [5]:
%%mimicSQL --notebook_name 01-sepsis-gender-distribution.ipynb

Hi

'Actual notebook name: '

'01-sepsis-gender-distribution.ipynb'

'Notebook name:'

'01-sepsis-gender-distribution.ipynb'

Hello! How can I assist you with your research today?

In [6]:
%%mimicSQL --notebook_name 01-sepsis-gender-distribution.ipynb

Retrieve all data on patients with “sepsis,” “severe sepsis,” or “septic shock”

'Actual notebook name: '

'01-sepsis-gender-distribution.ipynb'

'Notebook name:'

'01-sepsis-gender-distribution.ipynb'

Sure, to retrieve all data on patients with "sepsis," "severe sepsis," or "septic shock", we can use the DIAGNOSES_ICD table which contains ICD diagnoses for patients. The ICD9 codes for sepsis, severe sepsis, and septic shock are '99591', '99592', and '78552' respectively. Here is the SQL query:

```sql
SELECT *
FROM DIAGNOSES_ICD
WHERE ICD9_CODE IN ('99591', '99592', '78552')
```

  row_id subject_id hadm_id seq_num icd9_code
0   1547        117  164853      16     99592
1   1604        124  138376       6     99592
2    505         64  172056       3     99591
3    679         85  112077      18     99591
4    131         21  111970       2     78552

In [7]:
%%mimicSQL --notebook_name 01-sepsis-gender-distribution.ipynb

can you add gender to this table

'Actual notebook name: '

'01-sepsis-gender-distribution.ipynb'

'Notebook name:'

'01-sepsis-gender-distribution.ipynb'

Sure, to add gender to this table, we need to join the DIAGNOSES_ICD table with the PATIENTS table on the SUBJECT_ID field. Here is the SQL query:

```sql
SELECT DIAGNOSES_ICD.*, PATIENTS.GENDER
FROM DIAGNOSES_ICD
JOIN PATIENTS ON DIAGNOSES_ICD.SUBJECT_ID = PATIENTS.SUBJECT_ID
WHERE DIAGNOSES_ICD.ICD9_CODE IN ('99591', '99592', '78552')
```

'Actual notebook name: '

  row_id subject_id hadm_id seq_num icd9_code GENDER
0   1547        117  164853      16     99592      F
1   1604        124  138376       6     99592      M
2    505         64  172056       3     99591      F
3    679         85  112077      18     99591      M
4    131         21  111970       2     78552      M

In [8]:
%%mimicSQL --notebook_name 01-sepsis-gender-distribution.ipynb

can you add admit time and date of birth to this table as well

'Actual notebook name: '

'01-sepsis-gender-distribution.ipynb'

'Notebook name:'

'01-sepsis-gender-distribution.ipynb'

Sure, to add admit time and date of birth, we need to join the ADMISSIONS table for admit time and the PATIENTS table for date of birth. Here is the SQL query:

```sql
SELECT DIAGNOSES_ICD.*, PATIENTS.GENDER, PATIENTS.DOB, ADMISSIONS.ADMITTIME
FROM DIAGNOSES_ICD
JOIN PATIENTS ON DIAGNOSES_ICD.SUBJECT_ID = PATIENTS.SUBJECT_ID
JOIN ADMISSIONS ON DIAGNOSES_ICD.HADM_ID = ADMISSIONS.HADM_ID
WHERE DIAGNOSES_ICD.ICD9_CODE IN ('99591', '99592', '78552')
```

'Actual notebook name: '

,row_id,subject_id,hadm_id,seq_num,icd9_code,GENDER,DOB,ADMITTIME
0,1547,117,164853,16,99592,F,2083-12-28 00:00:00.000,2133-11-13 21:34:00.000
1,1604,124,138376,6,99592,M,2090-11-19 00:00:00.000,2165-12-31 18:55:00.000
2,505,64,172056,3,99591,F,2116-06-27 00:00:00.000,2143-03-03 09:25:00.000
3,679,85,112077,18,99591,M,2090-09-18 00:00:00.000,2167-07-25 18:49:00.000
4,131,21,111970,2,78552,M,2047-04-04 00:00:00.000,2135-01-30 20:50:00.000

In [11]:
%%mimicPython --notebook_name 01-sepsis-gender-distribution.ipynb

can you take the SQL table and add an age column to it using DOB and ADMITTIME. Then, show me the whole table again

'Notebook name:'

'01-sepsis-gender-distribution.ipynb'

Sure, we can calculate the age at the time of admission by subtracting the date of birth from the admission time. Here is how you can do it in Python:

```python
import pandas as pd
from datetime import datetime

# Assuming df is your dataframe
df['ADMITTIME'] = pd.to_datetime(df['ADMITTIME'])
df['DOB'] = pd.to_datetime(df['DOB'])

# Calculate age at the time of admission
df['AGE'] = df['ADMITTIME'].dt.year - df['DOB'].dt.year

# Display the dataframe
df
```

Please replace 'df' with your actual dataframe name.

 Result :     row_id subject_id hadm_id seq_num icd9_code GENDER        DOB
0     1547        117  164853      16     99592      F 2083-12-28  \
1     1604        124  138376       6     99592      M 2090-11-19
2      505         64  172056       3     99591      F 2116-06-27
3      679         85  112077      18     99591      M 2090-09-18
4      131         21  111970       2     78552      M 2047-04-04
..     ...        ...     ...     ...       ...    ...        ...
994  80276       7201  155244       3     99592      M 2096-01-10
995  80280       7201  155244       7     78552      M 2096-01-10
996  88526       7897  175798       4     78552      F 2027-02-05
997  88529       7897  175798       7     99592      F 2027-02-05
998  81755       7310  148664       5     99592      F 2085-11-22

              ADMITTIME  AGE
0   2133-11-13 21:34:00   50
1   2165-12-31 18:55:00   75
2   2143-03-03 09:25:00   27
3   2167-07-25 18:49:00   77
4   2135-01-30 20:50:00   88
..                  ...  ...
994 2183-10-03 13:14:00   87
995 2183-10-03 13:14:00   87
996 2107-01-08 17:43:00   80
997 2107-01-08 17:43:00   80
998 2173-09-14 03:48:00   88

[999 rows x 9 columns]

In [ ]:
%%mimicSQL --notebook_name 01-sepsis-gender-distribution.ipynb

Give me the same table but include gender of subjects

In [ ]:
%%mimicPython

What is the gender distribution of these patients? In percentage.